---
kind: type
id: T:Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions
source: html/3f3bd792-6e89-1417-e11f-cd013a30b614.htm
---
# Autodesk.Revit.DB.Structure.AlignedFreeFormSetOrientationOptions

Orientation options for Aligned Free Form Rebar set.

## Syntax (C#)
```csharp
public enum AlignedFreeFormSetOrientationOptions
```